PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16f18313.inc
;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1           8007h
;   CONFIG2           8008h
;   CONFIG3           8009h
;   CONFIG4           800Ah
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1         EQU  H'8007'
_CONFIG2         EQU  H'8008'
_CONFIG3         EQU  H'8009'
_CONFIG4         EQU  H'800A'

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_LP      EQU  H'FFF8'    ; LP (crystal oscillator) optimized for 32.768 kHz; PFM set to low power
_FEXTOSC_XT      EQU  H'FFF9'    ; XT (crystal oscillator) from 100 kHz to 4 MHz; PFM set to medium power
_FEXTOSC_HS      EQU  H'FFFA'    ; HS (crystal oscillator) above 4 MHz; PFM set to high power
_FEXTOSC_Unimplemented EQU  H'FFFB'    ; Unimplemented
_FEXTOSC_OFF     EQU  H'FFFC'    ; Oscillator not enabled
_FEXTOSC_ECL     EQU  H'FFFD'    ; EC (external clock) below 100 kHz; PFM set to low power
_FEXTOSC_ECM     EQU  H'FFFE'    ; EC (external clock) for 100 kHz to 8 MHz; PFM set to medium power
_FEXTOSC_ECH     EQU  H'FFFF'    ; EC (external clock) above 8 MHz; PFM set to high power (device manufacturing default)

_RSTOSC_HFINT32  EQU  H'FF8F'    ; HFINTOSC with 2x PLL (32MHz)
_RSTOSC_EXT4X    EQU  H'FF9F'    ; EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_EXT2X    EQU  H'FFAF'    ; EXTOSC with 2x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_SOSC     EQU  H'FFBF'    ; SOSC (31kHz)
_RSTOSC_LFINT    EQU  H'FFCF'    ; LFINTOSC (31kHz)
_RSTOSC_Unimplemented EQU  H'FFDF'    ; Unimplemented
_RSTOSC_HFINT1   EQU  H'FFEF'    ; HFINTOSC (1MHz)
_RSTOSC_EXT1X    EQU  H'FFFF'    ; EXTOSC operating per FEXTOSC bits (device manufacturing default)

_CLKOUTEN_ON     EQU  H'FEFF'    ; CLKOUT function is enabled; FOSC/4 clock appears at OSC2
_CLKOUTEN_OFF    EQU  H'FFFF'    ; CLKOUT function is disabled; I/O or oscillator function on OSC2

_CSWEN_OFF       EQU  H'F7FF'    ; The NOSC and NDIV bits cannot be changed by user software
_CSWEN_ON        EQU  H'FFFF'    ; Writing to NOSC and NDIV is allowed

_FCMEN_OFF       EQU  H'DFFF'    ; Fail-Safe Clock Monitor is disabled
_FCMEN_ON        EQU  H'FFFF'    ; Fail-Safe Clock Monitor is enabled

;----- CONFIG2 Options --------------------------------------------------
_MCLRE_OFF       EQU  H'FFFE'    ; MCLR/VPP pin function is digital input; MCLR internally disabled; Weak pull-up under control of port pin's WPU control bit.
_MCLRE_ON        EQU  H'FFFF'    ; MCLR/VPP pin function is MCLR; Weak pull-up enabled 

_PWRTE_ON        EQU  H'FFFD'    ; PWRT enabled
_PWRTE_OFF       EQU  H'FFFF'    ; PWRT disabled

_WDTE_OFF        EQU  H'FFF3'    ; WDT disabled; SWDTEN is ignored
_WDTE_SWDTEN     EQU  H'FFF7'    ; WDT controlled by the SWDTEN bit in the WDTCON register
_WDTE_SLEEP      EQU  H'FFFB'    ; WDT enabled while running and disabled while in SLEEP/IDLE; SWDTEN is ignored
_WDTE_ON         EQU  H'FFFF'    ; WDT enabled, SWDTEN is ignored

_LPBOREN_ON      EQU  H'FFDF'    ; ULPBOR enabled
_LPBOREN_OFF     EQU  H'FFFF'    ; ULPBOR disabled

_BOREN_OFF       EQU  H'FF3F'    ; Brown-out Reset disabled
_BOREN_SBOREN    EQU  H'FF7F'    ; Brown-out Reset enabled according to SBOREN
_BOREN_SLEEP     EQU  H'FFBF'    ; Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored
_BOREN_ON        EQU  H'FFFF'    ; Brown-out Reset enabled, SBOREN bit ignored

_BORV_HIGH       EQU  H'FDFF'    ; Brown-out voltage (Vbor) set to 2.7V
_BORV_LOW        EQU  H'FFFF'    ; Brown-out voltage (Vbor) set to 2.45V

_PPS1WAY_OFF     EQU  H'F7FF'    ; The PPSLOCK bit can be set and cleared repeatedly (subject to the unlock sequence)
_PPS1WAY_ON      EQU  H'FFFF'    ; The PPSLOCK bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle

_STVREN_OFF      EQU  H'EFFF'    ; Stack Overflow or Underflow will not cause a Reset
_STVREN_ON       EQU  H'FFFF'    ; Stack Overflow or Underflow will cause a Reset

_DEBUG_ON        EQU  H'DFFF'    ; Background debugger enabled
_DEBUG_OFF       EQU  H'FFFF'    ; Background debugger disabled

;----- CONFIG3 Options --------------------------------------------------
_WRT_ALL         EQU  H'FFFC'    ; 0000h to 07FFh write protected, no addresses may be modified
_WRT_HALF        EQU  H'FFFD'    ; 0000h to 03FFh write-protected, 0400h to 07FFh may be modified
_WRT_BOOT        EQU  H'FFFE'    ; 0000h to 01FFh write-protected, 0200h to 07FFh may be modified
_WRT_OFF         EQU  H'FFFF'    ; Write protection off

_LVP_OFF         EQU  H'DFFF'    ; HV on MCLR/VPP must be used for programming.
_LVP_ON          EQU  H'FFFF'    ; Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored.

;----- CONFIG4 Options --------------------------------------------------
_CP_ON           EQU  H'FFFE'    ; User NVM code protection enabled
_CP_OFF          EQU  H'FFFF'    ; User NVM code protection disabled

_CPD_ON          EQU  H'FFFD'    ; Data NVM code protection enabled
_CPD_OFF         EQU  H'FFFF'    ; Data NVM code protection disabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
